In [158]:
import pandas as pd

In [159]:
df = pd.DataFrame({'Math': [4, 4, 7, 8, 12, 13, 15, 18, 22, 23, 23, 25],
                   'Eng': [2, 5, 4, 7, 7, 8, 5, 4, 5, 11, 13, 8]})

In [160]:
df.shape

(12, 2)

In [161]:
df['bin1'] = pd.qcut(df['Math'], q=5)
df

    Math  Eng          bin1
0      4    2  (3.999, 7.2]
1      4    5  (3.999, 7.2]
2      7    4  (3.999, 7.2]
3      8    7   (7.2, 12.4]
4     12    7   (7.2, 12.4]
5     13    8  (12.4, 16.8]
6     15    5  (12.4, 16.8]
7     18    4  (16.8, 22.8]
8     22    5  (16.8, 22.8]
9     23   11  (22.8, 25.0]
10    23   13  (22.8, 25.0]
11    25    8  (22.8, 25.0]

In [162]:
df['bin1'].value_counts()

bin1
(3.999, 7.2]    3
(22.8, 25.0]    3
(7.2, 12.4]     2
(12.4, 16.8]    2
(16.8, 22.8]    2
Name: count, dtype: int64

In [163]:
df['bin2'] = pd.qcut(df['Math'], q=[0, .2, .4, .6, .8, 1])
df

    Math  Eng          bin1          bin2
0      4    2  (3.999, 7.2]  (3.999, 7.2]
1      4    5  (3.999, 7.2]  (3.999, 7.2]
2      7    4  (3.999, 7.2]  (3.999, 7.2]
3      8    7   (7.2, 12.4]   (7.2, 12.4]
4     12    7   (7.2, 12.4]   (7.2, 12.4]
5     13    8  (12.4, 16.8]  (12.4, 16.8]
6     15    5  (12.4, 16.8]  (12.4, 16.8]
7     18    4  (16.8, 22.8]  (16.8, 22.8]
8     22    5  (16.8, 22.8]  (16.8, 22.8]
9     23   11  (22.8, 25.0]  (22.8, 25.0]
10    23   13  (22.8, 25.0]  (22.8, 25.0]
11    25    8  (22.8, 25.0]  (22.8, 25.0]

In [164]:
df['bin3'] = pd.qcut(df['Math'],
                           q=[0, .2, .4, .6, .8, 1],
                           labels=['A', 'B', 'C', 'D', 'E'])
df

    Math  Eng          bin1          bin2 bin3
0      4    2  (3.999, 7.2]  (3.999, 7.2]    A
1      4    5  (3.999, 7.2]  (3.999, 7.2]    A
2      7    4  (3.999, 7.2]  (3.999, 7.2]    A
3      8    7   (7.2, 12.4]   (7.2, 12.4]    B
4     12    7   (7.2, 12.4]   (7.2, 12.4]    B
5     13    8  (12.4, 16.8]  (12.4, 16.8]    C
6     15    5  (12.4, 16.8]  (12.4, 16.8]    C
7     18    4  (16.8, 22.8]  (16.8, 22.8]    D
8     22    5  (16.8, 22.8]  (16.8, 22.8]    D
9     23   11  (22.8, 25.0]  (22.8, 25.0]    E
10    23   13  (22.8, 25.0]  (22.8, 25.0]    E
11    25    8  (22.8, 25.0]  (22.8, 25.0]    E

In [165]:
df['bin4'] = pd.cut(df['Eng'],
                      bins=[0, 5, 8, float('Inf')],
                      labels=['Bad', 'OK', 'Good'])
df

    Math  Eng          bin1          bin2 bin3  bin4
0      4    2  (3.999, 7.2]  (3.999, 7.2]    A   Bad
1      4    5  (3.999, 7.2]  (3.999, 7.2]    A   Bad
2      7    4  (3.999, 7.2]  (3.999, 7.2]    A   Bad
3      8    7   (7.2, 12.4]   (7.2, 12.4]    B    OK
4     12    7   (7.2, 12.4]   (7.2, 12.4]    B    OK
5     13    8  (12.4, 16.8]  (12.4, 16.8]    C    OK
6     15    5  (12.4, 16.8]  (12.4, 16.8]    C   Bad
7     18    4  (16.8, 22.8]  (16.8, 22.8]    D   Bad
8     22    5  (16.8, 22.8]  (16.8, 22.8]    D   Bad
9     23   11  (22.8, 25.0]  (22.8, 25.0]    E  Good
10    23   13  (22.8, 25.0]  (22.8, 25.0]    E  Good
11    25    8  (22.8, 25.0]  (22.8, 25.0]    E    OK

In [166]:
df['bin4'].value_counts()

bin4
Bad     6
OK      4
Good    2
Name: count, dtype: int64

In [167]:
import pandas as pd

In [168]:
gdp = [11, 22, 33, 44, 55, 66, 77]
countries = ['Spain', 'France', 'Spain', 'Germany', 'France']
df = pd.DataFrame(list(zip(gdp, countries)),
                  columns=['GDP', 'Countries'])
df

   GDP Countries
0   11     Spain
1   22    France
2   33     Spain
3   44   Germany
4   55    France

In [169]:
from sklearn import preprocessing
label_encoder = preprocessing.LabelEncoder()
df['labelCountries']= label_encoder.fit_transform(df['Countries']) 
df

   GDP Countries  labelCountries
0   11     Spain               2
1   22    France               0
2   33     Spain               2
3   44   Germany               1
4   55    France               0

In [170]:
dfOneHotEncoding = pd.get_dummies(df.Countries, prefix='Country')
print(dfOneHotEncoding.head())

   Country_France  Country_Germany  Country_Spain
0           False            False           True
1            True            False          False
2           False            False           True
3           False             True          False
4            True            False          False

In [171]:

df = pd.concat([df, dfOneHotEncoding], axis=1)
df

,GDP,Countries,labelCountries,Country_France,Country_Germany,Country_Spain
0,11,Spain,2,False,False,True
1,22,France,0,True,False,False
2,33,Spain,2,False,False,True
3,44,Germany,1,False,True,False
4,55,France,0,True,False,False

In [172]:
from sklearn.preprocessing import LabelBinarizer
y = LabelBinarizer().fit_transform(df.Countries)
y

array([[0, 0, 1],
       [1, 0, 0],
       [0, 0, 1],
       [0, 1, 0],
       [1, 0, 0]])

In [173]:
from sklearn.preprocessing import OneHotEncoder
y = OneHotEncoder().fit_transform(df[['Countries']]).toarray()
print(y)

[[0. 0. 1.]
 [1. 0. 0.]
 [0. 0. 1.]
 [0. 1. 0.]
 [1. 0. 0.]]

## khi nào sử dụng onehotencoding khi nào dùng LabelBinarizer ?
#### Nếu dụng label khi có dữ liệu so sánh, bạn vô tình đưa vô máy tính toán có sự chệnh lệch
### tính modun vecto

## 2.Function tranform
### 2.1 Nomolization
### 2.2 Standandization
### 2.2 Popater funtions

In [174]:
import pandas as pd

year = [2010,2011,2012,2013,2014,2015]

salaryHCM = [8.5,9.0,10.5,12.0,11.0,10.0]

salaryLA = [5.5,6.0,6.0,5.5,6.0,5.0]

df = pd.DataFrame(list(zip(year, salaryHCM,salaryLA)),
                  columns=['Year', 'HCM','LA'])
df

   Year   HCM   LA
0  2010   8.5  5.5
1  2011   9.0  6.0
2  2012  10.5  6.0
3  2013  12.0  5.5
4  2014  11.0  6.0
5  2015  10.0  5.0

### 2.1 Nomolization

### Công thức MAX ABSOLUTE
### [-1,1] = x(all)/|max|

In [175]:
max_la = df['LA'].abs().max()
df['macLA'] = df['LA'] / max_la
df

   Year   HCM   LA     macLA
0  2010   8.5  5.5  0.916667
1  2011   9.0  6.0  1.000000
2  2012  10.5  6.0  1.000000
3  2013  12.0  5.5  0.916667
4  2014  11.0  6.0  1.000000
5  2015  10.0  5.0  0.833333

In [176]:
max_HCM = df['HCM'].abs().max()
df['macHCM'] = df['HCM'] / max_HCM
df

   Year   HCM   LA     macLA    macHCM
0  2010   8.5  5.5  0.916667  0.708333
1  2011   9.0  6.0  1.000000  0.750000
2  2012  10.5  6.0  1.000000  0.875000
3  2013  12.0  5.5  0.916667  1.000000
4  2014  11.0  6.0  1.000000  0.916667
5  2015  10.0  5.0  0.833333  0.833333

In [177]:
from sklearn.preprocessing import MaxAbsScaler
scaler = MaxAbsScaler()
scaled = scaler.fit_transform(df[['HCM','LA']])
scaled_df = pd.DataFrame(scaled, columns=df[['HCM','LA']].columns)

print(scaled_df)

        HCM        LA
0  0.708333  0.916667
1  0.750000  1.000000
2  0.875000  1.000000
3  1.000000  0.916667
4  0.916667  1.000000
5  0.833333  0.833333

In [178]:
#hãy cho biết số lượng scaler của 4.5 và 5.75
vSc = scaler.transform([[4.5,5.75]])
vSc

/opt/homebrew/lib/python3.11/site-packages/sklearn/base.py:465: UserWarning: X does not have valid feature names, but MaxAbsScaler was fitted with feature names
  warnings.warn(

array([[0.375     , 0.95833333]])

In [179]:
#Nếu biết trước giá trị sau khi scale là 0.5 và 0.8 thì giá trị gốc tương ứng là:
vR = scaler.inverse_transform([[0.5,0.8]])
vR

array([[6. , 4.8]])

### Công thức (x(cột)-min)/max-min

In [180]:
#hàm min max scale, giá trị cũ đi qua hàm này sẽ trở về đoạn [0,1]
min_la = df['LA'].min()
max_la = df['LA'].max()
df['mmcLA'] = (df['LA'] - min_la) / (max_la - min_la)

df

   Year   HCM   LA     macLA    macHCM  mmcLA
0  2010   8.5  5.5  0.916667  0.708333    0.5
1  2011   9.0  6.0  1.000000  0.750000    1.0
2  2012  10.5  6.0  1.000000  0.875000    1.0
3  2013  12.0  5.5  0.916667  1.000000    0.5
4  2014  11.0  6.0  1.000000  0.916667    1.0
5  2015  10.0  5.0  0.833333  0.833333    0.0

In [181]:
#min-max scale cho HCM
min_HCM = df['HCM'].min()
max_HCM = df['HCM'].max()
df['mmcHCM'] = (df['HCM'] - min_HCM) / (max_HCM - min_HCM)
df

   Year   HCM   LA     macLA    macHCM  mmcLA    mmcHCM
0  2010   8.5  5.5  0.916667  0.708333    0.5  0.000000
1  2011   9.0  6.0  1.000000  0.750000    1.0  0.142857
2  2012  10.5  6.0  1.000000  0.875000    1.0  0.571429
3  2013  12.0  5.5  0.916667  1.000000    0.5  1.000000
4  2014  11.0  6.0  1.000000  0.916667    1.0  0.714286
5  2015  10.0  5.0  0.833333  0.833333    0.0  0.428571

In [182]:
#giả sử ta có lương HCM và LA
vSc = scaler.transform([[6.5,19]])
vSc
#kết quả sai vì bị tràn số

/opt/homebrew/lib/python3.11/site-packages/sklearn/base.py:465: UserWarning: X does not have valid feature names, but MaxAbsScaler was fitted with feature names
  warnings.warn(

array([[0.54166667, 3.16666667]])

In [183]:
vR = scaler.inverse_transform([[0.65,1.9]])
vR

array([[ 7.8, 11.4]])

In [184]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()
scaled = scaler.fit_transform(df[['HCM','LA']])
scaled_df = pd.DataFrame(scaled, columns=df[['HCM','LA']].columns)

print(scaled_df)

        HCM   LA
0  0.000000  0.5
1  0.142857  1.0
2  0.571429  1.0
3  1.000000  0.5
4  0.714286  1.0
5  0.428571  0.0

## 2.2 Standardization
### chuẩn hóa thoe ngữ cảnh

In [185]:
mean_la = df['LA'].mean()
std_la = df['LA'].std()
df['zLA'] = (df['LA'] - mean_la) / std_la
df

   Year   HCM   LA     macLA    macHCM  mmcLA    mmcHCM       zLA
0  2010   8.5  5.5  0.916667  0.708333    0.5  0.000000 -0.408248
1  2011   9.0  6.0  1.000000  0.750000    1.0  0.142857  0.816497
2  2012  10.5  6.0  1.000000  0.875000    1.0  0.571429  0.816497
3  2013  12.0  5.5  0.916667  1.000000    0.5  1.000000 -0.408248
4  2014  11.0  6.0  1.000000  0.916667    1.0  0.714286  0.816497
5  2015  10.0  5.0  0.833333  0.833333    0.0  0.428571 -1.632993

### Tính z-score của HCM với LA
### min - mean /std

In [186]:
df.describe()

,Year,HCM,LA,macLA,macHCM,mmcLA,mmcHCM,zLA
count,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000e+00
mean,2012.500000,10.166667,5.666667,0.944444,0.847222,0.666667,0.476190,-7.771561e-16
std,1.870829,1.290994,0.408248,0.068041,0.107583,0.408248,0.368856,1.000000e+00
min,2010.000000,8.500000,5.000000,0.833333,0.708333,0.000000,0.000000,-1.632993e+00
25%,2011.250000,9.250000,5.500000,0.916667,0.770833,0.500000,0.214286,-4.082483e-01
50%,2012.500000,10.250000,5.750000,0.958333,0.854167,0.750000,0.500000,2.041241e-01
75%,2013.750000,10.875000,6.000000,1.000000,0.906250,1.000000,0.678571,8.164966e-01
max,2015.000000,12.000000,6.000000,1.000000,1.000000,1.000000,1.000000,8.164966e-01

In [187]:
#StandardScaler Z-score
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
scaled = scaler.fit_transform(df[['HCM','LA']])

scaled_df = pd.DataFrame(scaled, columns=df[['HCM','LA']].columns)

print(scaled_df)

        HCM        LA
0 -1.414214 -0.447214
1 -0.989949  0.894427
2  0.282843  0.894427
3  1.555635 -0.447214
4  0.707107  0.894427
5 -0.141421 -1.788854

In [188]:
#Hãy dùng Z-Score để đưa ra kết luận
#Nếu một ngời có thu nhập 15 triệu thì ở HCM hay LA thì thoải mái hơn
sV = scaler.transform([[15,12]])
sV
#Nếu âm mức thu nhập thấp hơn mức trung bình
#Nếu dương mức thu nhập cao hơn mức trung bình
#4.10121933, hơn mức sống trung bình 4 lần độ lệch chuẩn
#16.99411663], hơn mức sống trung bình 16 lần độ lệch chuẩn
#Vậy làm sao mức sống tương đương với nhau?

/opt/homebrew/lib/python3.11/site-packages/sklearn/base.py:465: UserWarning: X does not have valid feature names, but StandardScaler was fitted with feature names
  warnings.warn(

array([[ 4.10121933, 16.99411663]])

### 2.3 Popular Functions

In [189]:
#Transform function: x^2, sqrt, log,sigmoid, relu
def funcX(x):
    return x*x + 1 #viết hàm x^2 + 1

df['TransformX'] = funcX(df[["LA"]])

df

   Year   HCM   LA     macLA    macHCM  mmcLA    mmcHCM       zLA  TransformX
0  2010   8.5  5.5  0.916667  0.708333    0.5  0.000000 -0.408248       31.25
1  2011   9.0  6.0  1.000000  0.750000    1.0  0.142857  0.816497       37.00
2  2012  10.5  6.0  1.000000  0.875000    1.0  0.571429  0.816497       37.00
3  2013  12.0  5.5  0.916667  1.000000    0.5  1.000000 -0.408248       31.25
4  2014  11.0  6.0  1.000000  0.916667    1.0  0.714286  0.816497       37.00
5  2015  10.0  5.0  0.833333  0.833333    0.0  0.428571 -1.632993       26.00

## Bài tập
### Sinh viên tính vẽ biểu đồ phân phối lượng trung bình
### Tính skenewss và kurtorsis của lương trung bình HCM
### Sử dụng làm log để transform dữ liệu
### Vẽ biểu đồ phân phối của dữ liệu lương trung bình
### Hãy so sánh độ nghiêng, độ nhọn phân phối sau khi transform

In [195]:
import pandas as pd

year = [2010,2011,2012,2013,2014,2015]

salaryHCM = [8.5,9.0,10.5,12.0,11.0,10.0]

salaryLA = [5.5,6.0,6.0,5.5,6.0,5.0]

df = pd.DataFrame(list(zip(year, salaryHCM,salaryLA)),
                  columns=['Year', 'HCM','LA'])
df

   Year   HCM   LA
0  2010   8.5  5.5
1  2011   9.0  6.0
2  2012  10.5  6.0
3  2013  12.0  5.5
4  2014  11.0  6.0
5  2015  10.0  5.0

In [199]:
#Biểu đồ phân phối lượng trung bình lương của HCM và LA
import seaborn as sns
import pandas as pd
mean_HCM = df['HCM'].mean()
mean_LA = df['LA'].mean()

In [ ]:
#Tính skenewss và kurtorsis của lương trung bình HCM